ruby/ruby_trainning/app/controllers/home_controller.rb

	def index
		@users = User.order('created_at DESC').limit(1)
		@tags = Tag.all
		@posts = Post.order('created_at DESC').limit(10)
---
SELECT  "users".* FROM "users" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 2]]
SELECT "tags".* FROM "tags"
SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 10]]