ruby/ruby_trainning/app/controllers/posts_controller.rb

  def show
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sdadas"], ["content", "asdasdasd"], ["deleted_at", "2017-11-20 06:13:00"], ["created_at", "2017-11-20 06:13:49.132646"], ["updated_at", "2017-11-20 06:13:49.132646"]]