ruby/ruby_trainning/app/controllers/tags_controller.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "asdad"], ["created_at", "2017-11-20 06:17:48.703320"], ["updated_at", "2017-11-20 06:17:48.703320"]]
---
  def create
    @tag = Tag.new(tag_params)

    respond_to do |format|
      if @tag.save

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_tag
      @tag = Tag.find(params[:id])