ruby/ruby_trainning/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["email", ""], ["password_digest", ""], ["created_at", "2017-11-17 08:04:14.926715"], ["updated_at", "2017-11-17 08:04:14.926715"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save